Repository: Tencent-RTC/TUIKit_iOS
Catalog: application/App-UIKit/Resource/Localized/Localized.xcstrings
Source language: en
Languages: ar, ja, zh_hans, zh_hant

# App_Call
source: Call
ar: اتصال
ja: 発信
zh_hans: 拨打

source: Are you sure you want to log out?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟
ja: ログアウトしてもよろしいですか？
zh_hans: 确定退出当前账号吗?
zh_hant: 確定退出當前帳號嗎?

# Audio Call
source: Voice Call
ar: مكالمة صوتية
ja: 音声通話
zh_hans: 语音通话

source: Avatar
ar: الصورة الرمزية
ja: アバター
zh_hans: 头像

source: Basic Setting
ar: الإعدادات الأساسية
ja: 基本設定
zh_hans: 基础设置

source: BeautyLevel
ar: مستوى التجميل
ja: 美顔レベル
zh_hans: 美颜级别

source: Call
ar: مكالمة
ja: 通話
zh_hans: 通话

# callContent
source: Ringtone/Floating window/Less stutter
ar: نغمة الرنين/النافذة العائمة/تقليل التأخير
ja: 着信音/フローティングウィンドウ/遅延軽減
zh_hans: 响铃通知·通话悬浮窗·通话卡顿优化

source: Call Params Setting
ar: إعدادات معلمات المكالمة
ja: 通話パラメータ設定
zh_hans: 通话自定义参数设置

source: Call Settings
ar: إعدادات المكالمة
ja: 通話設定
zh_hans: 通话设置

source: Cancel
ar: إلغاء
ja: キャンセル
zh_hans: 取消
zh_hant: 取消

source: Change Language
ar: تغيير اللغة
ja: 言語を変更
zh_hans: 切换语言

source: Chinese characters, letters, numbers and underscores, 1 – 20 words
ar: الأحرف الصينية والحروف والأرقام والشرطات السفلية، 1-20 حرف
ja: 漢字、英字、数字、アンダースコアのみ、1〜20文字
zh_hans: 仅限中文、字母、数字和下划线，1–20个字
zh_hant: 僅限中文、字母、數字和下劃線，1–20個字

source: Conference Type
ar: نوع المؤتمر
ja: 会議タイプ
zh_hans: 会议类型

source: Create Room
ar: إنشاء غرفة
ja: ルームを作成
zh_hans: 创建会议

# EditAliasDesc
source: Only letters, digits, underscores, and Chinese characters.
ar: الحروف والأرقام والشرطات السفلية والأحرف الصينية فقط.
ja: 英字、数字、アンダースコア、漢字のみ使用可能です。
zh_hans: 仅限中文、字母、数字和下划线

# EnableFloating
source: Floating
ar: نافذة عائمة
ja: フローティング
zh_hans: 显示悬浮窗按钮

# EnableIncomingBanner
source: Incoming Banner
ar: شعار المكالمة الواردة
ja: 着信バナー
zh_hans: 横幅显示来电

# EnableAITranscriber
source: AI Transcriber
ar: النسخ بالذكاء الاصطناعي
ja: AI文字起こし
zh_hans: AI转录

# EnableVirtualBackground
source: Virtual Background
ar: خلفية افتراضية
ja: バーチャル背景
zh_hans: 显示虚拟背景按钮

source: Enter a room ID
ar: أدخل معرف الغرفة
ja: ルームIDを入力
zh_hans: 请输入会议号

source: Enter a userId
ar: أدخل معرف المستخدم
ja: ユーザーIDを入力
zh_hans: 请输入用户名
zh_hant: 請輸入用戶名

source: Enter a valid room ID
ar: أدخل معرف غرفة صالح
ja: 有効なルームIDを入力してください
zh_hans: 请输入正确房间号

source: Exit
ar: خروج
ja: 終了
zh_hans: 退出

# ExpendedInfo
source: Expended
ar: معلومات موسعة
ja: 拡張情報
zh_hans: 扩展信息

source: Fill
ar: ملء
ja: フィル
zh_hans: 充满

source: Fill Mode
ar: وضع الملء
ja: フィルモード
zh_hans: 填充模式

source: Fit
ar: ملاءمة
ja: フィット
zh_hans: 自适应

source: Free Speech Conference
ar: مؤتمر حرية التحدث
ja: 自由発言会議
zh_hans: 自由发言会议

source: Generating room number, please try again later
ar: جاري إنشاء رقم الغرفة، يرجى المحاولة لاحقاً
ja: ルーム番号を生成中です。後でもう一度お試しください
zh_hans: 正在生成会议号，请稍后重试

source: Go To Settings
ar: الذهاب إلى الإعدادات
ja: 設定へ
zh_hans: 去设置

source: Group ID
ar: معرف المجموعة
ja: グループID
zh_hans: 群组ID

source: Horizontal
ar: أفقي
ja: 横向き
zh_hans: 横屏

# InputGroupId
source: Please enter the ChatGroup ID
ar: يرجى إدخال معرف مجموعة الدردشة
ja: チャットグループIDを入力してください
zh_hans: 请输入ChatGroup ID

# InputRoomId
source: Please enter the Room ID
ar: يرجى إدخال معرف الغرفة
ja: ルームIDを入力してください
zh_hans: 请输入Room ID

# InputUserIds
source: Please enter the User ID, separated by ","
ar: يرجى إدخال معرف المستخدم، مفصولة بـ ","
ja: ユーザーIDを入力してください（カンマ区切り）
zh_hans: 请输入User ID，以","分隔

source: Join Room
ar: انضمام للغرفة
ja: ルームに参加
zh_hans: 加入房间

source: Join GroupCall
ar: انضمام لمكالمة جماعية
ja: グループ通話に参加
zh_hans: 加入群组通话

source: Language
ar: اللغة
ja: 言語
zh_hans: 语言

source: Live
ar: بث مباشر
ja: ライブ
zh_hans: 直播
zh_hant: 直播

# liveContent
source: Live preview/Beauty filters/Multi-host
ar: معاينة البث/فلاتر التجميل/مضيفين متعددين
ja: ライブプレビュー/美顔フィルター/マルチホスト
zh_hans: 开播预览·智能美颜·连麦PK

source: Log
ar: السجل
ja: ログ
zh_hans: 日志

source: Log In
ar: تسجيل الدخول
ja: ログイン
zh_hans: 登录
zh_hant: 登錄

source: Log out
ar: تسجيل الخروج
ja: ログアウト
zh_hans: 退出登录

source: Logged In
ar: تم تسجيل الدخول
ja: ログイン成功
zh_hans: 登录成功
zh_hant: 登錄成功

source: Me
ar: أنا
ja: マイページ
zh_hans: 我
zh_hant: 我

source: Media Type
ar: نوع الوسائط
ja: メディアタイプ
zh_hans: 媒体类型

source: Mic
ar: الميكروفون
ja: マイク
zh_hans: 开启音频

# MuteMode
source: Mute
ar: كتم الصوت
ja: ミュート
zh_hans: 静音模式

source: Name
ar: الاسم
ja: 名前を設定
zh_hans: 设置名字
zh_hant: 設置名字

source: Nickname
ar: الاسم المستعار
ja: ニックネーム
zh_hans: 昵称

source: No nickname
ar: لا يوجد اسم مستعار
ja: ニックネーム未設定
zh_hans: 昵称未设置

source: Not Set
ar: غير محدد
ja: 未設定
zh_hans: 未设置

# OfflinePushInfo
source: OfflinePush
ar: إشعار دون اتصال
ja: オフラインプッシュ
zh_hans: 离线推送信息

source: OK
ar: موافق
zh_hans: 确认

source: On-stage Speech Conference
ar: مؤتمر التحدث على المنصة
ja: 挙手発言会議
zh_hans: 举手发言会议

source: Operate Success
ar: تمت العملية بنجاح
ja: 操作成功
zh_hans: 操作成功
zh_hant: 操作成功

source: Optional Parameters
ar: معلمات اختيارية
ja: オプションパラメータ
zh_hans: 可选参数

# OtherSetting
source: Other Settings
ar: إعدادات أخرى
ja: その他の設定
zh_hans: 其他设置

source: Personal Center
ar: المركز الشخصي
ja: 個人センター
zh_hans: 个人中心

# profileUpdateFailed
source: update failed
ar: فشل التحديث
ja: 更新に失敗しました
zh_hans: 更改失败

source: Register
ar: تسجيل
ja: 登録
zh_hans: 注册
zh_hant: 註冊

source: Registered successfully
ar: تم التسجيل بنجاح
ja: 登録成功
zh_hans: 注册成功
zh_hant: 註冊成功

source: Resolution
ar: الدقة
ja: 解像度
zh_hans: 分辨率

source: Resolution Mode
ar: وضع الدقة
ja: 画面モード
zh_hans: 横竖屏

# RingSetting
source: Ring
ar: نغمة الرنين
ja: 着信音
zh_hans: 铃声设置

source: Room ID
ar: معرف الغرفة
ja: ルームID
zh_hans: 房间号

source: Room Id(Int)
ar: معرف الغرفة (رقم)
ja: ルームID（数値）
zh_hans: 房间Id(数字)

source: Room Id(String)
ar: معرف الغرفة (نص)
ja: ルームID（文字列）
zh_hans: 房间Id(字符串)

source: Rotation
ar: التدوير
ja: 回転
zh_hans: 旋转角度

source: Save
ar: حفظ
ja: 保存
zh_hans: 保存
zh_hant: 保存

source: Schedule Room
ar: جدولة الغرفة
ja: ルームを予約
zh_hans: 预定房间

source: Screen_Auto
ar: تلقائي
ja: 自動
zh_hans: 自动

source: Screen_Horizontal
ar: عرض أفقي
ja: 横画面表示
zh_hans: 横屏观看

source: Screen_Vertical
ar: عرض عمودي
ja: 縦画面表示
zh_hans: 竖屏观看

source: Set Avatar
ar: تعيين الصورة الرمزية
ja: アバターを設定
zh_hans: 设置头像

# SetAvatarTip
source: Please enter the URL address of the avatar.
ar: يرجى إدخال عنوان URL للصورة الرمزية.
ja: アバターのURLを入力してください。
zh_hans: 请输入头像的URL地址。

source: Set Extend
ar: تعيين معلومات موسعة
ja: 拡張情報を設定
zh_hans: 设置扩展信息

# SetExtendTip
source: Please enter extended information.
ar: يرجى إدخال المعلومات الموسعة.
ja: 拡張情報を入力してください。
zh_hans: 请输入扩展信息。

source: Set OffLineInfo
ar: تعيين معلومات دون اتصال
ja: オフラインプッシュを設定
zh_hans: 设置离线推送消息

# SetOffLineInfoTip
source: Please enter the json string of the offline push message.
ar: يرجى إدخال سلسلة JSON للرسالة دون اتصال.
ja: オフラインプッシュメッセージのJSON文字列を入力してください。
zh_hans: 请输入离线推送消息的json串。

source: Set Ring
ar: تعيين نغمة الرنين
ja: 着信音を設定
zh_hans: 设置铃声

# SetRingTip
source: Please enter the ringtone address.
ar: يرجى إدخال عنوان نغمة الرنين.
ja: 着信音のアドレスを入力してください。
zh_hans: 请输入铃声地址。

source: Settings
ar: الإعدادات
ja: 設定
zh_hans: 设置

source: share
ar: مشاركة
ja: 共有
zh_hans: 分享

# sharelog
source: Share and Upload Logs
ar: مشاركة وتحميل السجلات
ja: ログを共有・アップロード
zh_hans: 分享上传日志

source: Speaker
ar: مكبر الصوت
ja: スピーカー
zh_hans: 开启扬声器

# Tencent Real-Time Communication
source: Tencent RTC
ar: تينسنت للاتصالات في الوقت الفعلي
zh_hans: 腾讯云音视频

source: Test Environment
ar: بيئة الاختبار
ja: テスト環境
zh_hans: 测试环境

source: Auto Login
ar: تسجيل دخول تلقائي
ja: 自動ログイン
zh_hans: 自动登录

source: Timeout
ar: انتهاء المهلة
ja: タイムアウト
zh_hans: 呼叫超时时长

# tuiChat
source: Chat
ar: الدردشة
ja: チャット
zh_hans: 聊天

# tuiChatContent
source: Group chat/Contacts/Audio chat/Data syn
ar: دردشة جماعية/جهات الاتصال/دردشة صوتية/مزامنة البيانات
ja: グループチャット/連絡先/音声チャット/データ同期
zh_hans: 群组聊天·好友通讯录·语音消息·资料多端同步

# tuiRoom
source: Conference
ar: المؤتمر
ja: 会議
zh_hans: 会议

# tuiRoomContent
source: Quick meeting/Invite/Manage participants/Share screen
ar: اجتماع سريع/دعوة/إدارة المشاركين/مشاركة الشاشة
ja: クイック会議/招待/参加者管理/画面共有
zh_hans: 快速会议·邀请入会·会中管控·共享屏幕

# UICompnent
source: UIKit
ar: مكونات واجهة المستخدم
zh_hans: UI组件

source: Unviersal：xxx
ar: عام: xxx
ja: 汎用レイアウト：xxx
zh_hans: 通用布局：xxx
zh_hant: 通用布局：xxx

source: User ID
ar: معرف المستخدم
ja: ユーザーID
zh_hans: 用户ID

source: Vertical
ar: عمودي
ja: 縦向き
zh_hans: 竖屏

source: Video
ar: فيديو
ja: ビデオ
zh_hans: 开启视频

source: Video Call
ar: مكالمة فيديو
ja: ビデオ通話
zh_hans: 视频通话

source: Video Setting
ar: إعدادات الفيديو
ja: ビデオ設定
zh_hans: 视频设置

source: Yes
ar: نعم
ja: はい
zh_hans: 确定
zh_hant: 確定

source: Your Name
ar: اسمك
ja: お名前
zh_hans: 您的姓名

source: Fans
ar: المتابعون
ja: フォロワー
zh_hans: 粉丝
zh_hant: 粉絲

source: Likes
ar: إعجابات
ja: いいね
zh_hans: 点赞
zh_hant: 點讚

source: Go Live
ar: بدء البث
ja: ライブ配信開始
zh_hans: 开直播
zh_hant: 開直播

source: Video Live
ar: بث فيديو مباشر
ja: ビデオライブ
zh_hans: 在线直播
zh_hant: 在線直播

source: Create Interactive Video Live with Live API for a Seamless Streaming Experience.
ar: إنشاء بث فيديو تفاعلي مباشر باستخدام Live API لتجربة بث سلسة.
ja: Live APIでインタラクティブなビデオライブを作成し、シームレスな配信体験を。
zh_hans: 通过 Live API 构建互动视频直播，为您带来清晰流畅的直播体验。
zh_hant: 通過 Live API 構建互動視頻直播，為您帶來清晰流暢的直播體驗。

source: Voice Room
ar: غرفة صوتية
ja: ボイスルーム
zh_hans: 语聊房
zh_hant: 語聊房

source: Enable Interactive Voice Room with Live API for an Enhanced Communication Experience.
ar: تمكين غرفة صوتية تفاعلية باستخدام Live API لتجربة اتصال محسنة.
ja: Live APIでインタラクティブなボイスルームを有効にし、コミュニケーション体験を向上。
zh_hans: 通过 Live API 搭建互动语音聊天室，为您带来低延迟高音质的体验。
zh_hant: 通過 Live API 搭建互動語音聊天室，為您帶來低延遲高音質的體驗。

source: Likes Count
ar: عدد الإعجابات
ja: いいね数
zh_hans: 点赞数量
zh_hant: 點讚數量
